Masmiseim36/nxpSDK/devices/MIMXRT758S/periph/PERI_CLKCTL3.h
#define CLKCTL3_LPI2C15FCLKSEL_SEL_MASK          (0x3U)
#define CLKCTL3_LPI2C15FCLKSEL_SEL_SHIFT         (0U)
/*! SEL - LPI2C15 Clock Source Select
 *  0b00..baseclk_sense
 *  0b01..fro1_max
 *  0b10..fro1_div2
 *  0b11..fro2_max
 */
#define CLKCTL3_LPI2C15FCLKSEL_SEL(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL3_LPI2C15FCLKSEL_SEL_SHIFT)) & CLKCTL3_LPI2C15FCLKSEL_SEL_MASK)

#define CLKCTL3_LPI2C15FCLKSEL_SEL_EN_MASK       (0x4U)
#define CLKCTL3_LPI2C15FCLKSEL_SEL_EN_SHIFT      (2U)
/*! SEL_EN - Clock MUX Output Enable
 *  0b0..Gates output of clock mux.
 *  0b1..Enables output of clock mux.
 */
#define CLKCTL3_LPI2C15FCLKSEL_SEL_EN(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL3_LPI2C15FCLKSEL_SEL_EN_SHIFT)) & CLKCTL3_LPI2C15FCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name LPI2C15FCLKDIV - LPI2C15 Functional Clock Divider */
/*! @{ */

#define CLKCTL3_LPI2C15FCLKDIV_DIV_MASK          (0xFFU)
#define CLKCTL3_LPI2C15FCLKDIV_DIV_SHIFT         (0U)
/*! DIV - LPI2C15 Clock Divider Value */
#define CLKCTL3_LPI2C15FCLKDIV_DIV(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL3_LPI2C15FCLKDIV_DIV_SHIFT)) & CLKCTL3_LPI2C15FCLKDIV_DIV_MASK)

#define CLKCTL3_LPI2C15FCLKDIV_BUSY_MASK         (0x10000000U)
#define CLKCTL3_LPI2C15FCLKDIV_BUSY_SHIFT        (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL3_LPI2C15FCLKDIV_BUSY(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL3_LPI2C15FCLKDIV_BUSY_SHIFT)) & CLKCTL3_LPI2C15FCLKDIV_BUSY_MASK)

#define CLKCTL3_LPI2C15FCLKDIV_RESET_MASK        (0x20000000U)
#define CLKCTL3_LPI2C15FCLKDIV_RESET_SHIFT       (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL3_LPI2C15FCLKDIV_RESET(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL3_LPI2C15FCLKDIV_RESET_SHIFT)) & CLKCTL3_LPI2C15FCLKDIV_RESET_MASK)

#define CLKCTL3_LPI2C15FCLKDIV_HALT_MASK         (0x40000000U)
#define CLKCTL3_LPI2C15FCLKDIV_HALT_SHIFT        (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL3_LPI2C15FCLKDIV_HALT(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL3_LPI2C15FCLKDIV_HALT_SHIFT)) & CLKCTL3_LPI2C15FCLKDIV_HALT_MASK)

#define CLKCTL3_LPI2C15FCLKDIV_REQFLAG_MASK      (0x80000000U)
#define CLKCTL3_LPI2C15FCLKDIV_REQFLAG_SHIFT     (31U)
/*! REQFLAG - Request Flag
 *  0b0..The Divider change has been finished (clock being divided must be running for this status to change).
 *  0b1..The Divider value is being changed.
 */
#define CLKCTL3_LPI2C15FCLKDIV_REQFLAG(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL3_LPI2C15FCLKDIV_REQFLAG_SHIFT)) & CLKCTL3_LPI2C15FCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name CLKOUTCLKSEL - CLKOUT_VDD1 Clock Source Select */
/*! @{ */

#define CLKCTL3_CLKOUTCLKSEL_SEL_MASK            (0x3U)
#define CLKCTL3_CLKOUTCLKSEL_SEL_SHIFT           (0U)
/*! SEL - Clock Source Select
 *  0b00..baseclk_sense
 *  0b01..audio_pll_pfd3
 *  0b10..fro2_max
 *  0b11..fro1_max
 */
#define CLKCTL3_CLKOUTCLKSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL3_CLKOUTCLKSEL_SEL_SHIFT)) & CLKCTL3_CLKOUTCLKSEL_SEL_MASK)

#define CLKCTL3_CLKOUTCLKSEL_SEL_EN_MASK         (0x4U)
#define CLKCTL3_CLKOUTCLKSEL_SEL_EN_SHIFT        (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates output of clock mux.
 *  0b1..Enables output of clock mux.
 */
#define CLKCTL3_CLKOUTCLKSEL_SEL_EN(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL3_CLKOUTCLKSEL_SEL_EN_SHIFT)) & CLKCTL3_CLKOUTCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name CLKOUTCLKDIV - CLKOUT_VDD1 Clock Divider */
/*! @{ */

#define CLKCTL3_CLKOUTCLKDIV_DIV_MASK            (0xFFU)
#define CLKCTL3_CLKOUTCLKDIV_DIV_SHIFT           (0U)
/*! DIV - CLKOUT_VDD1 Clock Divider */
#define CLKCTL3_CLKOUTCLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL3_CLKOUTCLKDIV_DIV_SHIFT)) & CLKCTL3_CLKOUTCLKDIV_DIV_MASK)

#define CLKCTL3_CLKOUTCLKDIV_BUSY_MASK           (0x10000000U)
#define CLKCTL3_CLKOUTCLKDIV_BUSY_SHIFT          (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT_VDD1 is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL3_CLKOUTCLKDIV_BUSY(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL3_CLKOUTCLKDIV_BUSY_SHIFT)) & CLKCTL3_CLKOUTCLKDIV_BUSY_MASK)

#define CLKCTL3_CLKOUTCLKDIV_RESET_MASK          (0x20000000U)
#define CLKCTL3_CLKOUTCLKDIV_RESET_SHIFT         (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Divider Counter Reset
 */
#define CLKCTL3_CLKOUTCLKDIV_RESET(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL3_CLKOUTCLKDIV_RESET_SHIFT)) & CLKCTL3_CLKOUTCLKDIV_RESET_MASK)

#define CLKCTL3_CLKOUTCLKDIV_HALT_MASK           (0x40000000U)
#define CLKCTL3_CLKOUTCLKDIV_HALT_SHIFT          (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL3_CLKOUTCLKDIV_HALT(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL3_CLKOUTCLKDIV_HALT_SHIFT)) & CLKCTL3_CLKOUTCLKDIV_HALT_MASK)

#define CLKCTL3_CLKOUTCLKDIV_REQFLAG_MASK        (0x80000000U)
#define CLKCTL3_CLKOUTCLKDIV_REQFLAG_SHIFT       (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL3_CLKOUTCLKDIV_REQFLAG(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL3_CLKOUTCLKDIV_REQFLAG_SHIFT)) & CLKCTL3_CLKOUTCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name PSCCTL0_SENS - VDD1_SENSE Peripheral Clock Control 0 */
/*! @{ */

#define CLKCTL3_PSCCTL0_SENS_MU0_MASK            (0x10U)
#define CLKCTL3_PSCCTL0_SENS_MU0_SHIFT           (4U)
/*! MU0 - MU0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_SENS_MU0(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_SENS_MU0_SHIFT)) & CLKCTL3_PSCCTL0_SENS_MU0_MASK)

#define CLKCTL3_PSCCTL0_SENS_MU1_MASK            (0x20U)
#define CLKCTL3_PSCCTL0_SENS_MU1_SHIFT           (5U)
/*! MU1 - MU1 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_SENS_MU1(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_SENS_MU1_SHIFT)) & CLKCTL3_PSCCTL0_SENS_MU1_MASK)

#define CLKCTL3_PSCCTL0_SENS_MU2_MASK            (0x40U)
#define CLKCTL3_PSCCTL0_SENS_MU2_SHIFT           (6U)
/*! MU2 - MU2 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_SENS_MU2(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_SENS_MU2_SHIFT)) & CLKCTL3_PSCCTL0_SENS_MU2_MASK)

#define CLKCTL3_PSCCTL0_SENS_OSTIMER_MASK        (0x80U)
#define CLKCTL3_PSCCTL0_SENS_OSTIMER_SHIFT       (7U)
/*! OSTIMER - OSTIMER Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_SENS_OSTIMER(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_SENS_OSTIMER_SHIFT)) & CLKCTL3_PSCCTL0_SENS_OSTIMER_MASK)

#define CLKCTL3_PSCCTL0_SENS_SEMA42_0_MASK       (0x100U)
#define CLKCTL3_PSCCTL0_SENS_SEMA42_0_SHIFT      (8U)
/*! SEMA42_0 - SEMA42_0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_SENS_SEMA42_0(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_SENS_SEMA42_0_SHIFT)) & CLKCTL3_PSCCTL0_SENS_SEMA42_0_MASK)

#define CLKCTL3_PSCCTL0_SENS_SDADC0_MASK         (0x200U)
#define CLKCTL3_PSCCTL0_SENS_SDADC0_SHIFT        (9U)
/*! SDADC0 - SDADC0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_SENS_SDADC0(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_SENS_SDADC0_SHIFT)) & CLKCTL3_PSCCTL0_SENS_SDADC0_MASK)

#define CLKCTL3_PSCCTL0_SENS_SARADC0_MASK        (0x400U)
#define CLKCTL3_PSCCTL0_SENS_SARADC0_SHIFT       (10U)
/*! SARADC0 - ADC0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_SENS_SARADC0(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_SENS_SARADC0_SHIFT)) & CLKCTL3_PSCCTL0_SENS_SARADC0_MASK)

#define CLKCTL3_PSCCTL0_SENS_ACMP0_MASK          (0x800U)
#define CLKCTL3_PSCCTL0_SENS_ACMP0_SHIFT         (11U)
/*! ACMP0 - ACMP0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_SENS_ACMP0(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_SENS_ACMP0_SHIFT)) & CLKCTL3_PSCCTL0_SENS_ACMP0_MASK)

#define CLKCTL3_PSCCTL0_SENS_MICFIL_MASK         (0x1000U)
#define CLKCTL3_PSCCTL0_SENS_MICFIL_SHIFT        (12U)
/*! MICFIL - MICFIL Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_SENS_MICFIL(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_SENS_MICFIL_SHIFT)) & CLKCTL3_PSCCTL0_SENS_MICFIL_MASK)

#define CLKCTL3_PSCCTL0_SENS_GLIKEY4_MASK        (0x2000U)
#define CLKCTL3_PSCCTL0_SENS_GLIKEY4_SHIFT       (13U)
/*! GLIKEY4 - GLIKEY4 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_SENS_GLIKEY4(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_SENS_GLIKEY4_SHIFT)) & CLKCTL3_PSCCTL0_SENS_GLIKEY4_MASK)

#define CLKCTL3_PSCCTL0_SENS_DBG_RT700_MASK      (0x100000U)
#define CLKCTL3_PSCCTL0_SENS_DBG_RT700_SHIFT     (20U)
/*! DBG_RT700 - DBG_RT700 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_SENS_DBG_RT700(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_SENS_DBG_RT700_SHIFT)) & CLKCTL3_PSCCTL0_SENS_DBG_RT700_MASK)

